zjw939057120/LiteOS/targets/GD32F470IGH6/Src/usart.c
    /* 设置USART2_Tx的复用功能选择 */
    gpio_af_set(GPIOC, GPIO_AF_7, GPIO_PIN_10);

    /* 设置USART2_Rx的复用功能选择 */
    gpio_af_set(GPIOC, GPIO_AF_7, GPIO_PIN_5);

    /* USART2_Tx的模式设置 */
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_10);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_10);

    /* USART2_Rx的模式设置 */
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_5);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_5);

    /* 配置USART的参数 */
    usart_deinit(USART2);                                 /* 复位USART2 */
    usart_baudrate_set(USART2, bound);                    /* 设置波特率 */
    usart_stop_bit_set(USART2, USART_STB_1BIT);           /* 一个停止位 */
    usart_word_length_set(USART2, USART_WL_8BIT);         /* 字长为8位数据格式 */
    usart_parity_config(USART2, USART_PM_NONE);           /* 无奇偶校验位 */
    usart_transmit_config(USART2, USART_TRANSMIT_ENABLE); /* 使能发送 */
#if USART_EN_RX  /* 如果使能了接收 */
    usart_receive_config(USART2, USART_RECEIVE_ENABLE);   /* 使能接收 */
    usart_interrupt_enable(USART2, USART_INT_RBNE);       /* 使能接收缓冲区非空中断 */ 
	usart_interrupt_enable(USART2, USART_INT_IDLE);       /* 使能空闲线中断 */	
    /* 配置NVIC，并设置中断优先级 */
    nvic_irq_enable(USART2_IRQn, 3, 3);                   /* 抢占优先级3，子优先级3 */
#endif
    usart_enable(USART2);	                                /* 使能串口 */
}
/**
 * @brief       串口3初始化函数
 * @param       bound: 波特率, 根据自己需要设置波特率值
 * @retval      无
 */
void usart3_init(uint32_t bound)
{
    /* IO 及 时钟配置 */
    rcu_periph_clock_enable(RCU_GPIOA);     /* 使能GPIOA时钟 */
    rcu_periph_clock_enable(RCU_UART3);    /* 使能串口时钟 */

    /* 设置UART3_Tx的复用功能选择 */
    gpio_af_set(GPIOA, GPIO_AF_8, GPIO_PIN_0);

    /* 设置UART3_Rx的复用功能选择 */
    gpio_af_set(GPIOA, GPIO_AF_8, GPIO_PIN_1);

    /* UART3_Tx的模式设置 */
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_0);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_0);

    /* UART3_Rx的模式设置 */
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_1);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_1);

    /* 配置UART的参数 */
    usart_deinit(UART3);                                 /* 复位UART3 */
    usart_baudrate_set(UART3, bound);                    /* 设置波特率 */
    usart_stop_bit_set(UART3, USART_STB_1BIT);           /* 一个停止位 */
    usart_word_length_set(UART3, USART_WL_8BIT);         /* 字长为8位数据格式 */
    usart_parity_config(UART3, USART_PM_NONE);           /* 无奇偶校验位 */
    usart_transmit_config(UART3, USART_TRANSMIT_ENABLE); /* 使能发送 */
#if USART_EN_RX  /* 如果使能了接收 */
    usart_receive_config(UART3, USART_RECEIVE_ENABLE);   /* 使能接收 */
    usart_interrupt_enable(UART3, USART_INT_RBNE);       /* 使能接收缓冲区非空中断 */
	usart_interrupt_enable(UART3, USART_INT_IDLE);       /* 使能空闲线中断 */    
    /* 配置NVIC，并设置中断优先级 */
    nvic_irq_enable(UART3_IRQn, 3, 3);                   /* 抢占优先级3，子优先级3 */
#endif
    usart_enable(UART3);	                                /* 使能串口 */
}
/**
 * @brief       串口4初始化函数
 * @param       bound: 波特率, 根据自己需要设置波特率值
 * @retval      无
 */
void usart4_init(uint32_t bound)
{
    /* IO 及 时钟配置 */
    rcu_periph_clock_enable(RCU_GPIOD);     /* 使能GPIOD时钟 */
	rcu_periph_clock_enable(RCU_GPIOC);     /* 使能GPIOC时钟 */
    rcu_periph_clock_enable(RCU_UART4);    /* 使能串口时钟 */

    /* 设置UART4_Tx的复用功能选择 */
    gpio_af_set(GPIOC, GPIO_AF_8, GPIO_PIN_12);

    /* 设置UART4_Rx的复用功能选择 */
    gpio_af_set(GPIOD, GPIO_AF_8, GPIO_PIN_2);

    /* UART4_Tx的模式设置 */
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_12);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_12);

    /* UART4_Rx的模式设置 */
    gpio_mode_set(GPIOD, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_2);
    gpio_output_options_set(GPIOD, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_2);

    /* 配置UART的参数 */
    usart_deinit(UART4);                                 /* 复位UART4 */
    usart_baudrate_set(UART4, bound);                    /* 设置波特率 */
    usart_stop_bit_set(UART4, USART_STB_1BIT);           /* 一个停止位 */
    usart_word_length_set(UART4, USART_WL_8BIT);         /* 字长为8位数据格式 */
    usart_parity_config(UART4, USART_PM_NONE);           /* 无奇偶校验位 */
    usart_transmit_config(UART4, USART_TRANSMIT_ENABLE); /* 使能发送 */
#if USART_EN_RX  /* 如果使能了接收 */
    usart_receive_config(UART4, USART_RECEIVE_ENABLE);   /* 使能接收 */
    usart_interrupt_enable(UART4, USART_INT_RBNE);       /* 使能接收缓冲区非空中断 */ 
	usart_interrupt_enable(UART4, USART_INT_IDLE);       /* 使能空闲线中断 */	
    /* 配置NVIC，并设置中断优先级 */
    nvic_irq_enable(UART4_IRQn, 3, 3);                   /* 抢占优先级3，子优先级3 */
#endif
    usart_enable(UART4);	                                /* 使能串口 */
}
/**
 * @brief       串口5初始化函数
 * @param       bound: 波特率, 根据自己需要设置波特率值
 * @retval      无
 */
void usart5_init(uint32_t bound)
{
    /* IO 及 时钟配置 */
	rcu_periph_clock_enable(RCU_GPIOC);     /* 使能GPIOC时钟 */
    rcu_periph_clock_enable(RCU_USART5);    /* 使能串口时钟 */

    /* 设置USART5_Tx的复用功能选择 */
    gpio_af_set(GPIOC, GPIO_AF_8, GPIO_PIN_7);

    /* 设置USART5_Rx的复用功能选择 */
    gpio_af_set(GPIOC, GPIO_AF_8, GPIO_PIN_6);

    /* USART5_Tx的模式设置 */
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_7);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_7);

    /* USART5_Rx的模式设置 */
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_6);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);

    /* 配置USART的参数 */
    usart_deinit(USART5);                                 /* 复位USART0 */
    usart_baudrate_set(USART5, bound);                    /* 设置波特率 */
    usart_stop_bit_set(USART5, USART_STB_1BIT);           /* 一个停止位 */
    usart_word_length_set(USART5, USART_WL_8BIT);         /* 字长为8位数据格式 */
    usart_parity_config(USART5, USART_PM_NONE);           /* 无奇偶校验位 */
    usart_transmit_config(USART5, USART_TRANSMIT_ENABLE); /* 使能发送 */
#if USART_EN_RX  /* 如果使能了接收 */
    usart_receive_config(USART5, USART_RECEIVE_ENABLE);   /* 使能接收 */
    usart_interrupt_enable(USART5, USART_INT_RBNE);       /* 使能接收缓冲区非空中断 */ 
	usart_interrupt_enable(USART5, USART_INT_IDLE);       /* 使能空闲线中断 */	
    /* 配置NVIC，并设置中断优先级 */
    nvic_irq_enable(USART5_IRQn, 3, 3);                   /* 抢占优先级3，子优先级3 */
#endif
    usart_enable(USART5);	                                /* 使能串口 */
}
/**
 * @brief       串口6初始化函数
 * @param       bound: 波特率, 根据自己需要设置波特率值
 * @retval      无
 */
void usart6_init(uint32_t bound)
{
    /* IO 及 时钟配置 */
    rcu_periph_clock_enable(RCU_GPIOF);     /* 使能GPIOF时钟 */
    rcu_periph_clock_enable(RCU_UART6);    /* 使能串口时钟 */

    /* 设置UART6_Tx的复用功能选择 */
    gpio_af_set(GPIOF, GPIO_AF_8, GPIO_PIN_7);

    /* 设置UART6_Rx的复用功能选择 */
    gpio_af_set(GPIOF, GPIO_AF_8, GPIO_PIN_6);

