zjw939057120/LiteOS/targets/GD32F470IGH6/Src/usart.c
    /* UART6_Tx的模式设置 */
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_7);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_7);

    /* UART6_Rx的模式设置 */
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_6);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);

    /* 配置UART的参数 */
    usart_deinit(UART6);                                 /* 复位UART6 */
    usart_baudrate_set(UART6, bound);                    /* 设置波特率 */
    usart_stop_bit_set(UART6, USART_STB_1BIT);           /* 一个停止位 */
    usart_word_length_set(UART6, USART_WL_8BIT);         /* 字长为8位数据格式 */
    usart_parity_config(UART6, USART_PM_NONE);           /* 无奇偶校验位 */
    usart_transmit_config(UART6, USART_TRANSMIT_ENABLE); /* 使能发送 */
#if USART_EN_RX  /* 如果使能了接收 */
    usart_receive_config(UART6, USART_RECEIVE_ENABLE);   /* 使能接收 */
    usart_interrupt_enable(UART6, USART_INT_RBNE);       /* 使能接收缓冲区非空中断 */
	usart_interrupt_enable(UART6, USART_INT_IDLE);       /* 使能空闲线中断 */    
    /* 配置NVIC，并设置中断优先级 */
    nvic_irq_enable(UART6_IRQn, 0, 0);                   /* 抢占优先级0，子优先级0 */
#endif
    usart_enable(UART6);	                                /* 使能串口 */
//	usart_interrupt_flag_clear(UART6,USART_INT_FLAG_TC);
}
//串口发送单字节函数
void Seria_SendByte(uint32_t USARTx,uint8_t Byte)
{
	usart_data_transmit(USARTx, Byte); 	
	while (usart_flag_get(USARTx, USART_FLAG_TC) == RESET); 
}
//串口发送一组数据函数
void Seria_SendArray(uint32_t USARTx,uint8_t *Array, uint16_t Length) 
{ 	
	uint16_t i; 	
	for (i = 0; i < Length; i ++) 	
	{ 		
		Seria_SendByte(USARTx,Array[i]); 	
	} 
}

void req_USART0(void)
{
	uint8_t Len;
	USART0_TX_BUF[0] = 0xFF;
	USART0_TX_BUF[1] = 0x61;
	USART0_TX_BUF[2] = 0x02;
	USART0_TX_BUF[3] = 0x01;
    USART0_TX_BUF[4] = 0x9C;
    
	Len = 5;
	Seria_SendArray(USART0,USART0_TX_BUF,Len);
}
void req_USART1(void)
{
	uint8_t Len;
	USART1_TX_BUF[0] = 0xFF;
	USART1_TX_BUF[1] = 0x01;
	USART1_TX_BUF[2] = 0x86;
	USART1_TX_BUF[3] = 0x00;
    USART1_TX_BUF[4] = 0x00;
    USART1_TX_BUF[5] = 0x00;
    USART1_TX_BUF[6] = 0x00;
    USART1_TX_BUF[7] = 0x00;
    USART1_TX_BUF[8] = 0x79;
    
	Len = 9;
	Seria_SendArray(USART1,USART1_TX_BUF,Len);
}
void req_USART2(void)
{
	uint8_t Len;
	USART2_TX_BUF[0] = 0x11;
	USART2_TX_BUF[1] = 0x01;
	USART2_TX_BUF[2] = 0x01;
	USART2_TX_BUF[3] = 0xED;
	Len = 4;
	Seria_SendArray(USART2,USART2_TX_BUF,Len);
}
void req_USART3(void)
{
	uint8_t Len;
	USART3_TX_BUF[0] = 0x11;
	USART3_TX_BUF[1] = 0x02;
	USART3_TX_BUF[2] = 0x0B;
	USART3_TX_BUF[3] = 0x07;
	USART3_TX_BUF[4] = 0xDB;
	Len = 5;
	Seria_SendArray(UART3,USART3_TX_BUF,Len);
}
void req_USART4(void)
{}
void req_USART5(void)
{}
void req_USART6(void)
{}

void UsartInit(void)
{
    // usart0_init(9600U);
    usart1_init(9600U);
    // usart2_init(9600U);
    // usart3_init(9600U);
    // usart4_init(9600U);
    // usart5_init(9600U);
    // usart6_init(115200U);
}

